using System;

// Вывести на экран ангийский алфавит
// Используем символьную арифметику + цикл

char glif = 'a';

while(glif <= 'z')
{
    Console.WriteLine(glif);
    glif++;
}
