using System;

// Написать программу вычисления значения функции y=f(a)

int f = 6;    // взяли произвольное число
int y = f * f - 5;    // расчет по формуле 
Console.WriteLine(y);